{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of various frontend files and components.",
  "frontend/index.css": "Tailwind base styles and CSS variables defining color tokens, theming, and global background/text rules.",
  "frontend/index.html": "HTML entry point containing SEO metadata and script loader for the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app in the CartProvider.",
  "frontend/src/components/catalog/ProductCard.tsx": "Displays a product card with image, details, formatted INR price, and add‑to‑cart action.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper including the global background, header, footer, and routed page outlet.",
  "frontend/src/components/layout/YogaMorphBackground.tsx": "Animated background component cycling yoga pose images with crossfade, noise overlay, and reduced‑motion handling.",
  "frontend/src/components/navigation/SiteFooter.tsx": "Footer with brand info, Instagram link, support contact details, and Caffeine.ai attribution.",
  "frontend/src/components/navigation/SiteHeader.tsx": "Responsive site header with navigation links, cart button, and a mobile slide-out menu.",
  "frontend/src/data/copy.ts": "Static marketing copy defining hero text, philosophy sections, launch info, and footer content.",
  "frontend/src/data/products.ts": "Defines Product interface and a catalog of product objects including yoga mats and resistance bands.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, and identity management using AuthClient.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Hook detecting the user's reduced motion preference via a media query.",
  "frontend/src/hooks/useYogaBackgroundDiagnostics.ts": "Development hook that preloads yoga background assets and logs warnings for any failed loads.",
  "frontend/src/index.css": "Tailwind-based global styles defining color tokens, typography, and layered background textures.",
  "frontend/src/lib/currency.ts": "Formats numbers into INR currency using Intl.NumberFormat.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClient and Internet Identity providers.",
  "frontend/src/pages/AuthPage.tsx": "Provides login and signup forms with client-side validation and tabbed UI.",
  "frontend/src/pages/CartPage.tsx": "Displays cart items with quantity controls, removal actions, and an empty-cart fallback.",
  "frontend/src/pages/CatalogPage.tsx": "Shows product catalog with category filtering, grouping, and navigation.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow including empty cart, payment selection, and order confirmation.",
  "frontend/src/pages/HomePage.tsx": "Renders the hero section, featured categories, and navigation to catalog filters.",
  "frontend/src/pages/NotFoundPage.tsx": "Displays a 404 message with navigation options to home or catalog.",
  "frontend/src/pages/ProductDetailPage.tsx": "React page showing detailed product info with image, description, features, quantity controls, and add‑to‑cart behavior using router params.",
  "frontend/src/qa/background-regression-checklist.md": "QA checklist for verifying yoga morphing background loading, animation behavior, accessibility, layering, and production readiness.",
  "frontend/src/store/cart.tsx": "React context managing cart state with add, update, remove, clear, and computed totals for items and subtotal.",
  "frontend/tailwind.config.js": "Tailwind config defining theme extensions, color tokens, container settings, animations, and plugin setup.",
  "project_state.json": "Project state metadata describing IKIGAI site scope, design guidelines, features, known issues, and version tracking."
}